/* 信04 2351131 韦世贸 */
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：输入一个符合要求的整数
  输入参数：根据no值x，打印“请输出第x个int型整数”
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
int get_int(int no)
{
	int a ;/*输入值和序号*/
	while (1) {
		
		cout << "请输入第" << no << "个int型整数" << endl;
		cin >> a;
		
		if (cin.fail()) {
			cin.clear();
			cin.ignore(114514, '\n');
			continue;
			
		}
		return a;
	}
		
	
}
/***************************************************************************
  函数名称：max
  功    能：将两个数比大小
  输入参数：两个数
  返 回 值：大数
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
int max(int x, int y) 
{
	if (x > y)
		return x;
	else
		return y;
}
/***************************************************************************
  函数名称：min
  功    能：将两个数比大小
  输入参数：两个数
  返 回 值：小数
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
int min(int x, int y) {
	if (x < y)
		return x;
	else
		return y;
}
/***************************************************************************
  函数名称：
  功    能：将四个数按从小到大顺序输出
  输入参数：
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
void output(int a, int b, int c, int d)
{
	int yi, er, san, si; /*输出时从左到右的顺序*/
	int m1, m2,m3,m4;/*起到桥梁的作用*/
	m1 = max(a, b);
	m2 = max(c, d);
	si = max(m1, m2);
	san = min(m1, m2);
	m3 = min(a, b);
	m4 = min(c, d);
	yi = min(m3, m4);
	er = max(m3, m4);
	cout << "从小到大依次是 :" << yi << " " << er << " " << san << " " << si << endl;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main不准动
***************************************************************************/
int main()
{
	int a, b, c, d;

	a = get_int(1);
	b = get_int(2);
	c = get_int(3);
	d = get_int(4);

	output(a, b, c, d);

	return 0;
}