/* 2351131 信04 韦世贸 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	if (n < 0) { /*负数特判*/
		cout << "-" << " ";
		n = -n;
	}
	else;
	if (n != -2147483648) {
		if (n < 10 && n >= 0) /*开始递归*/
			cout << char(n + '0') << " ";
		else {
			convert(n / 10);
			cout << char(n % 10 + '0') << " ";
		}
	}
	if (n == -2147483648) {/*下限特判*/
		n++;    /*不让数据超限*/
		n = -n;
		if (n < 10 && n >= 0) { /*再递归一次*/
			cout << char(n  +'0') << " " ;
		}
		else {
			convert(n / 10);
			cout << char(n % 10 + 1  + '0') << " ";/*最后再加一*/
		}
	}

}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n; //不考虑输入错误 

	convert(n);
	cout << endl;

	return 0;
}
